import unittest
from Task_1_unit_tests.mentors_names import get_top_3_names, get_unique_names


courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python", "Frontend-разработчик с нуля"]

mentors = [
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]


class Test_Mentors_Names(unittest.TestCase):
    def test_get_top_3_names(self):
        result = get_top_3_names(mentors)
        expected = 'Александр: 10 раз(а), Евгений: 5 раз(а), Максим: 4 раз(а)'
        self.assertEqual(result, expected)


    def test_get_unique_names(self):
        result = get_unique_names(mentors)
        expected = (f'Адилет, Азамат, Александр, Алексей, Алена, Анатолий, Анна, Антон, '
                    f'Вадим, Валерий, Владимир, Денис, Дмитрий, Евгений, Елена, Иван, Илья, '
                    f'Кирилл, Константин, Максим, Михаил, Никита, Николай, Олег, Павел, Ринат, '
                    f'Роман, Сергей, Татьяна, Тимур, Филипп, Эдгар, Юрий')
        self.assertEqual(result, expected)